unic = ("","одинадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать")
units = ("","одна","две","три","четыре","пять","шесть","семь","восемь","девять")
decades = ("","десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяноста")
hundreds = ("","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот")
def numbercoins(x):
    if(x==10):
        print(decades[1])
    elif (x == 0):
        print("ноль")
    elif(x%100//10==1):
        print(hundreds[x//100],end=" ")
        print(unic[x%10])
    else:
        print(hundreds[x//100],end=" ")
        print(decades[x//10%10],end=" ")
        print(units[x%10])

x = int(input("Введите число (0-999) "))
numbercoins(x)
